Revit 2024 API
ParameterTypeId.StructuralConnectionApprovalStatus Property
 "Approval Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralConnectionApprovalStatus { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionApprovalStatus As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralConnectionApprovalStatus {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace